tianrking/nrf54lm20-se05x-ncs/demo/se05x_demo_11_eth_testnet_wallet.c
#include <inttypes.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>

#include <zephyr/console/console.h>
#include <zephyr/logging/log.h>
#include <zephyr/sys/printk.h>

#include "fsl_sss_se05x_types.h"
#include "se05x_APDU.h"
#include "se05x_APDU_apis.h"
#include "se05x_demo.h"
#include "se05x_ecc_curves.h"
#include "se05x_enums.h"

LOG_MODULE_REGISTER(se05x_demo_eth_testnet, LOG_LEVEL_INF);

#define ETH_UART_CMD_MAX_LEN 192U
#define ETH_KECCAK256_LEN 32U
#define ETH_SECP256K1_PUBKEY_LEN 65U
#define ETH_ADDRESS_LEN 20U
#define ETH_TX_DATA_MAX_LEN 64U
#define ETH_MAX_RLP_LEN 512U

/*
 * Demo 11: eth_testnet_wallet.
 *
 * 这个 demo 把 Demo09/Demo10 已经验证过的 secp256k1 和 ETH legacy
 * signing 链路推进到真实 Sepolia 测试网可用的形态。核心差异是：
 * Demo11 使用 SE05x persistent object 0xEF110001 保存钱包私钥，所以地址稳定；
 * Demo10 使用 transient 测试 key，所以每次运行都可能产生新地址。
 *
 * 真实 ETH legacy 转账需要以下字段：
 *   1. nonce：发送地址已经发出的交易序号，必须从链上查询。
 *   2. gasPrice：legacy 交易 gas 单价，单位 wei。
 *   3. gasLimit：普通 ETH 转账通常是 21000。
 *   4. to：20 字节收款地址。
 *   5. value：转账金额，单位 wei。
 *   6. data：普通 ETH 转账为空；合约调用时是 calldata。
 *   7. chainId：EIP-155 防重放链 ID，Sepolia 是 11155111。
 *
 * 签名流程：
 *   1. nRF 将交易字段按 legacy/EIP-155 规则做 RLP 编码：
 *      [nonce, gasPrice, gasLimit, to, value, data, chainId, 0, 0]
 *   2. nRF 对 RLP signing payload 计算 Ethereum Keccak-256。
 *      注意 Ethereum 使用 Keccak-256，不是 FIPS SHA3-256。
 *   3. SE05x 创建或复用 persistent secp256k1 私钥对象 0xEF110001。
 *   4. nRF 读取公钥部分，用 Keccak-256(pubkey X||Y) 推导 ETH 地址。
 *   5. SE05x 对第 2 步 digest 执行 ECDSA sign_digest，私钥不导出。
 *   6. nRF 解析 DER 得到 r/s，并做 low-S 归一化。
 *   7. 因 SE05x ECDSA 接口不返回 recovery id，固件输出两个 v/raw tx
 *      候选；PC/手机通过恢复地址选择正确 v 后再广播。
 *
 * 安全边界：
 *   - secp256k1 未启用时会调用 CreateCurve 写一次曲线参数 NVM。
 *   - 钱包私钥对象 0xEF110001 会持久保存在 SE05x 内，掉电后仍存在。
 *   - 只有明确输入 AT+X=DELETE_TESTNET_KEY 才会删除 0xEF110001。
 *   - 生产钱包还需要用户确认、屏幕显示、PIN、交易解析、防回滚、
 *     备份恢复和通信认证；本 demo 只验证测试网签名主链路。
 *
 * 运行时串口只输出英文 ASCII，避免串口工具中文编码不一致造成乱码。
 */

typedef struct {
	uint8_t *data;
	size_t len;
	size_t cap;
} eth_buf_t;

typedef struct {
	uint64_t nonce;
	uint64_t gas_price_wei;
	uint64_t gas_limit;
	uint8_t to[ETH_ADDRESS_LEN];
	uint64_t value_wei;
	uint8_t data[ETH_TX_DATA_MAX_LEN];
	size_t data_len;
	uint64_t chain_id;
} eth_legacy_tx_t;

static const uint8_t k_eth_sample_to_address[ETH_ADDRESS_LEN] = {
	0x35, 0x35, 0x35, 0x35, 0x35, 0x35, 0x35, 0x35, 0x35, 0x35,
	0x35, 0x35, 0x35, 0x35, 0x35, 0x35, 0x35, 0x35, 0x35, 0x35,
};

static eth_legacy_tx_t g_eth_tx;

static const uint8_t k_secp256k1_n[32] = {
	0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff,
	0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xfe,
	0xba, 0xae, 0xdc, 0xe6, 0xaf, 0x48, 0xa0, 0x3b,
	0xbf, 0xd2, 0x5e, 0x8c, 0xd0, 0x36, 0x41, 0x41,
};

static const uint8_t k_secp256k1_half_n[32] = {
	0x7f, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff,
	0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff,
	0x5d, 0x57, 0x6e, 0x73, 0x57, 0xa4, 0x50, 0x1d,
	0xdf, 0xe9, 0x2f, 0x46, 0x68, 0x1b, 0x20, 0xa0,
};

static char eth_upper_command_char(char ch)
{
	if (ch >= 'a' && ch <= 'z') {
		return (char)(ch - ('a' - 'A'));
	}

	return ch;
}

static bool eth_is_line_end(int ch)
{
	return ch == '\r' || ch == '\n';
}

static char *eth_trim_line(char *line)
{
	char *start = line;
	char *end;

	while (*start == ' ' || *start == '\t') {
		++start;
	}

	end = start + strlen(start);
	while (end > start && (end[-1] == ' ' || end[-1] == '\t')) {
		*--end = '\0';
	}

	return start;
}

static bool eth_read_uart_line(char *line, size_t line_cap)
{
	size_t len = 0;

	if (line_cap == 0U) {
		return false;
	}

	line[0] = '\0';
	while (1) {
		int ch = console_getchar();

		if (eth_is_line_end(ch)) {
			if (len == 0U) {
				continue;
			}

			line[len] = '\0';
			return true;
		}

		if ((ch == '\b' || ch == 0x7f) && len > 0U) {
			line[--len] = '\0';
			continue;
		}

		if (len >= line_cap - 1U) {
			len = 0;
			line[0] = '\0';
			return false;
		}

		line[len++] = (char)ch;
		line[len] = '\0';
	}
}

static void eth_print_menu(void)
{
	printk("\n========== SE05x Demo 11: ETH testnet wallet ==========\n");
	printk("AT+H : Show this menu\n");
	printk("AT+A : Create/reuse persistent wallet key and print stable ETH address\n");
	printk("AT+P : Print current legacy transaction fields\n");
	printk("AT+R : Reset fields to Sepolia sample values\n");
	printk("AT+S : Sign current ETH Sepolia legacy transaction fields\n");
	printk("AT+N=<decimal> : Set nonce\n");
	printk("AT+G=<decimal> : Set gasPrice in wei\n");
	printk("AT+L=<decimal> : Set gasLimit\n");
	printk("AT+T=<40 hex>  : Set recipient address, with or without 0x\n");
	printk("AT+V=<decimal> : Set value in wei\n");
	printk("AT+C=<decimal> : Set EIP-155 chainId\n");
	printk("AT+D=<hex>     : Set data/calldata, empty allowed: AT+D=\n");
	printk("AT+X=DELETE_TESTNET_KEY : Delete persistent Demo11 wallet key\n");
	printk("AT+Q : Quit Demo 11 and close SE05x session\n");
	printk("Private key policy: persistent in SE05x object 0xEF110001, never exported.\n");
	printk("ETH note: SE05x returns ECDSA DER only; recovery id is selected by PC/phone.\n");
	printk("NVM policy: may create secp256k1 curve once and wallet key once.\n");
	printk("====================================================\n\n");
}

static void eth_print_hex_inline(const char *label, const uint8_t *data, size_t data_len)
{
	printk("%s=0x", label);
	for (size_t i = 0; i < data_len; i++) {
		printk("%02X", data[i]);
	}
	printk("\n");
}

static void eth_print_hex_block(const char *label, const uint8_t *data, size_t data_len)
{
	printk("%s len=%u hex=", label, (unsigned int)data_len);
	for (size_t i = 0; i < data_len; i++) {
		if (i > 0U && (i % 16U) == 0U) {
			printk("\n  ");
		}
		printk("%02X", data[i]);
		if ((i + 1U) < data_len) {
			printk(" ");
		}
	}
	printk("\n");
}

static void eth_reset_tx_to_sample(eth_legacy_tx_t *tx)
{
	memset(tx, 0, sizeof(*tx));
	tx->nonce = 0U;
	tx->gas_price_wei = 1000000000ULL;
	tx->gas_limit = 21000ULL;
	memcpy(tx->to, k_eth_sample_to_address, sizeof(tx->to));
	tx->value_wei = 100000000000000ULL;
	tx->data_len = 0U;
	tx->chain_id = 11155111ULL;
}

static void eth_print_current_tx(const eth_legacy_tx_t *tx)
{
	printk("\nCurrent ETH legacy transaction fields:\n");
	printk("ETH_TX_TYPE=legacy\n");
	printk("ETH_CHAIN_ID=%" PRIu64 "\n", tx->chain_id);
	printk("ETH_NONCE=%" PRIu64 "\n", tx->nonce);
	printk("ETH_GAS_PRICE_WEI=%" PRIu64 "\n", tx->gas_price_wei);
	printk("ETH_GAS_LIMIT=%" PRIu64 "\n", tx->gas_limit);
	eth_print_hex_inline("ETH_TO", tx->to, sizeof(tx->to));
	printk("ETH_VALUE_WEI=%" PRIu64 "\n", tx->value_wei);
	eth_print_hex_inline("ETH_DATA", tx->data, tx->data_len);
}

static bool eth_parse_u64_decimal(const char *text, uint64_t *out)
{
	uint64_t value = 0U;
	bool has_digit = false;

	while (*text == ' ' || *text == '\t') {
		++text;
	}

	for (; *text != '\0'; ++text) {
		if (*text == ' ' || *text == '\t') {
			while (*text == ' ' || *text == '\t') {
				++text;
			}
			break;
		}

		if (*text < '0' || *text > '9') {
			return false;
		}

