tianrking/nrf54lm20-se05x-ncs/demo/se05x_demo_11_eth_testnet_wallet.c
		const uint64_t digit = (uint64_t)(*text - '0');
		if (value > (UINT64_MAX - digit) / 10ULL) {
			return false;
		}
		value = (value * 10ULL) + digit;
		has_digit = true;
	}

	if (*text != '\0') {
		return false;
	}

	*out = value;
	return has_digit;
}

static int eth_hex_nibble(char ch)
{
	if (ch >= '0' && ch <= '9') {
		return ch - '0';
	}
	if (ch >= 'a' && ch <= 'f') {
		return ch - 'a' + 10;
	}
	if (ch >= 'A' && ch <= 'F') {
		return ch - 'A' + 10;
	}

	return -1;
}

static bool eth_parse_hex_bytes(const char *text, uint8_t *out, size_t out_cap,
				size_t *out_len)
{
	size_t len = 0U;

	while (*text == ' ' || *text == '\t') {
		++text;
	}
	if (text[0] == '0' && (text[1] == 'x' || text[1] == 'X')) {
		text += 2;
	}

	while (*text != '\0') {
		if (*text == ' ' || *text == '\t') {
			while (*text == ' ' || *text == '\t') {
				++text;
			}
			break;
		}

		const int hi = eth_hex_nibble(text[0]);
		const int lo = text[1] != '\0' ? eth_hex_nibble(text[1]) : -1;
		if (hi < 0 || lo < 0 || len >= out_cap) {
			return false;
		}
		out[len++] = (uint8_t)((hi << 4) | lo);
		text += 2;
	}

	if (*text != '\0') {
		return false;
	}

	*out_len = len;
	return true;
}

static bool eth_handle_set_command(const char *cmd, eth_legacy_tx_t *tx)
{
	if (!(cmd[0] == 'A' || cmd[0] == 'a') ||
	    !(cmd[1] == 'T' || cmd[1] == 't') ||
	    cmd[2] != '+' || cmd[4] != '=') {
		return false;
	}

	const char field = eth_upper_command_char(cmd[3]);
	const char *value = &cmd[5];
	uint64_t parsed_u64 = 0U;
	uint8_t parsed_bytes[ETH_TX_DATA_MAX_LEN] = { 0 };
	size_t parsed_len = 0U;

	switch (field) {
	case 'N':
		if (!eth_parse_u64_decimal(value, &parsed_u64)) {
			printk("ERR invalid nonce decimal.\n");
			return false;
		}
		tx->nonce = parsed_u64;
		printk("OK nonce=%" PRIu64 "\n", tx->nonce);
		return true;
	case 'G':
		if (!eth_parse_u64_decimal(value, &parsed_u64)) {
			printk("ERR invalid gasPrice decimal.\n");
			return false;
		}
		tx->gas_price_wei = parsed_u64;
		printk("OK gasPriceWei=%" PRIu64 "\n", tx->gas_price_wei);
		return true;
	case 'L':
		if (!eth_parse_u64_decimal(value, &parsed_u64)) {
			printk("ERR invalid gasLimit decimal.\n");
			return false;
		}
		tx->gas_limit = parsed_u64;
		printk("OK gasLimit=%" PRIu64 "\n", tx->gas_limit);
		return true;
	case 'T':
		if (!eth_parse_hex_bytes(value, parsed_bytes, sizeof(parsed_bytes), &parsed_len) ||
		    parsed_len != ETH_ADDRESS_LEN) {
			printk("ERR invalid to address; need 20 bytes / 40 hex chars.\n");
			return false;
		}
		memcpy(tx->to, parsed_bytes, ETH_ADDRESS_LEN);
		eth_print_hex_inline("OK to", tx->to, sizeof(tx->to));
		return true;
	case 'V':
		if (!eth_parse_u64_decimal(value, &parsed_u64)) {
			printk("ERR invalid value decimal.\n");
			return false;
		}
		tx->value_wei = parsed_u64;
		printk("OK valueWei=%" PRIu64 "\n", tx->value_wei);
		return true;
	case 'C':
		if (!eth_parse_u64_decimal(value, &parsed_u64)) {
			printk("ERR invalid chainId decimal.\n");
			return false;
		}
		tx->chain_id = parsed_u64;
		printk("OK chainId=%" PRIu64 "\n", tx->chain_id);
		return true;
	case 'D':
		if (!eth_parse_hex_bytes(value, parsed_bytes, sizeof(parsed_bytes), &parsed_len)) {
			printk("ERR invalid data hex; max %u bytes, even hex length required.\n",
			       (unsigned int)ETH_TX_DATA_MAX_LEN);
			return false;
		}
		memcpy(tx->data, parsed_bytes, parsed_len);
		tx->data_len = parsed_len;
		eth_print_hex_inline("OK data", tx->data, tx->data_len);
		return true;
	default:
		return false;
	}
}

static bool eth_buf_append(eth_buf_t *buf, const uint8_t *data, size_t data_len)
{
	if (buf->len + data_len > buf->cap) {
		return false;
	}

	memcpy(&buf->data[buf->len], data, data_len);
	buf->len += data_len;
	return true;
}

static bool eth_buf_append_byte(eth_buf_t *buf, uint8_t value)
{
	return eth_buf_append(buf, &value, 1U);
}

static size_t eth_uint64_to_be(uint64_t value, uint8_t out[8])
{
	size_t start = 0;

	for (size_t i = 0; i < 8U; i++) {
		out[i] = (uint8_t)(value >> ((7U - i) * 8U));
	}

	while (start < 8U && out[start] == 0U) {
		++start;
	}

	if (start == 8U) {
		return 0;
	}

	memmove(out, &out[start], 8U - start);
	return 8U - start;
}

static size_t eth_trim_leading_zeroes(const uint8_t *data, size_t data_len)
{
	size_t start = 0;

	while (start < data_len && data[start] == 0U) {
		++start;
	}

	return start;
}

static bool eth_rlp_append_length(eth_buf_t *buf, uint8_t short_offset, size_t payload_len)
{
	if (payload_len <= 55U) {
		return eth_buf_append_byte(buf, (uint8_t)(short_offset + payload_len));
	}

	uint8_t len_bytes[sizeof(size_t)] = { 0 };
	size_t tmp = payload_len;
	size_t len_len = 0;

	while (tmp > 0U) {
		len_bytes[sizeof(len_bytes) - 1U - len_len] = (uint8_t)(tmp & 0xffU);
		tmp >>= 8U;
		++len_len;
	}

	if (!eth_buf_append_byte(buf, (uint8_t)(short_offset + 55U + len_len))) {
		return false;
	}

	return eth_buf_append(buf, &len_bytes[sizeof(len_bytes) - len_len], len_len);
}

static bool eth_rlp_append_bytes(eth_buf_t *buf, const uint8_t *data, size_t data_len)
{
	if (data_len == 1U && data[0] < 0x80U) {
		return eth_buf_append_byte(buf, data[0]);
	}

	if (!eth_rlp_append_length(buf, 0x80U, data_len)) {
		return false;
	}

	return data_len == 0U || eth_buf_append(buf, data, data_len);
}

static bool eth_rlp_append_uint64(eth_buf_t *buf, uint64_t value)
{
	uint8_t be[8] = { 0 };
	size_t be_len = eth_uint64_to_be(value, be);

	return eth_rlp_append_bytes(buf, be, be_len);
}

static bool eth_rlp_append_bigint(eth_buf_t *buf, const uint8_t *data, size_t data_len)
{
	const size_t start = eth_trim_leading_zeroes(data, data_len);

	if (start == data_len) {
		return eth_rlp_append_bytes(buf, NULL, 0U);
	}

	return eth_rlp_append_bytes(buf, &data[start], data_len - start);
}

static bool eth_rlp_wrap_list(eth_buf_t *out, const uint8_t *payload, size_t payload_len)
{
	if (!eth_rlp_append_length(out, 0xc0U, payload_len)) {
		return false;
	}

	return eth_buf_append(out, payload, payload_len);
}

static uint64_t eth_rotl64(uint64_t value, unsigned int shift)
{
	return (value << shift) | (value >> (64U - shift));
}

static void eth_keccakf(uint64_t st[25])
{
	static const uint64_t rndc[24] = {
		0x0000000000000001ULL, 0x0000000000008082ULL,
		0x800000000000808aULL, 0x8000000080008000ULL,
		0x000000000000808bULL, 0x0000000080000001ULL,
		0x8000000080008081ULL, 0x8000000000008009ULL,
		0x000000000000008aULL, 0x0000000000000088ULL,
		0x0000000080008009ULL, 0x000000008000000aULL,
		0x000000008000808bULL, 0x800000000000008bULL,
		0x8000000000008089ULL, 0x8000000000008003ULL,
		0x8000000000008002ULL, 0x8000000000000080ULL,
		0x000000000000800aULL, 0x800000008000000aULL,
		0x8000000080008081ULL, 0x8000000000008080ULL,
		0x0000000080000001ULL, 0x8000000080008008ULL,
	};
	static const unsigned int rotc[24] = {
		1, 3, 6, 10, 15, 21, 28, 36, 45, 55, 2, 14,
		27, 41, 56, 8, 25, 43, 62, 18, 39, 61, 20, 44,
	};
	static const unsigned int piln[24] = {
		10, 7, 11, 17, 18, 3, 5, 16, 8, 21, 24, 4,
		15, 23, 19, 13, 12, 2, 20, 14, 22, 9, 6, 1,
	};

	for (size_t round = 0; round < 24U; round++) {
		uint64_t bc[5];

		for (size_t i = 0; i < 5U; i++) {
			bc[i] = st[i] ^ st[i + 5U] ^ st[i + 10U] ^
				st[i + 15U] ^ st[i + 20U];
		}
		for (size_t i = 0; i < 5U; i++) {
			const uint64_t t = bc[(i + 4U) % 5U] ^
					   eth_rotl64(bc[(i + 1U) % 5U], 1U);

			for (size_t j = 0; j < 25U; j += 5U) {
				st[j + i] ^= t;
			}
		}

