tianrking/nrf54lm20-se05x-ncs/demo/se05x_demo_11_eth_testnet_wallet.c
		uint64_t t = st[1];
		for (size_t i = 0; i < 24U; i++) {
			const size_t j = piln[i];
			const uint64_t old = st[j];

			st[j] = eth_rotl64(t, rotc[i]);
			t = old;
		}

		for (size_t j = 0; j < 25U; j += 5U) {
			for (size_t i = 0; i < 5U; i++) {
				bc[i] = st[j + i];
			}
			for (size_t i = 0; i < 5U; i++) {
				st[j + i] ^= (~bc[(i + 1U) % 5U]) &
					     bc[(i + 2U) % 5U];
			}
		}

		st[0] ^= rndc[round];
	}
}

static void eth_keccak_absorb_block(uint64_t st[25], const uint8_t *block, size_t rate)
{
	for (size_t i = 0; i < rate; i++) {
		st[i / 8U] ^= ((uint64_t)block[i]) << ((i % 8U) * 8U);
	}
	eth_keccakf(st);
}

static void eth_keccak256(const uint8_t *input, size_t input_len, uint8_t out[32])
{
	uint64_t st[25] = { 0 };
	uint8_t block[136] = { 0 };
	const size_t rate = sizeof(block);

	while (input_len >= rate) {
		eth_keccak_absorb_block(st, input, rate);
		input += rate;
		input_len -= rate;
	}

	memcpy(block, input, input_len);
	block[input_len] = 0x01U;
	block[rate - 1U] |= 0x80U;
	eth_keccak_absorb_block(st, block, rate);

	for (size_t i = 0; i < 32U; i++) {
		out[i] = (uint8_t)(st[i / 8U] >> ((i % 8U) * 8U));
	}
}

static bool eth_build_signing_rlp(const eth_legacy_tx_t *tx, uint8_t *out,
				  size_t out_cap, size_t *out_len)
{
	uint8_t payload_storage[256] = { 0 };
	eth_buf_t payload = { .data = payload_storage, .len = 0, .cap = sizeof(payload_storage) };
	eth_buf_t rlp = { .data = out, .len = 0, .cap = out_cap };

	if (!eth_rlp_append_uint64(&payload, tx->nonce) ||
	    !eth_rlp_append_uint64(&payload, tx->gas_price_wei) ||
	    !eth_rlp_append_uint64(&payload, tx->gas_limit) ||
	    !eth_rlp_append_bytes(&payload, tx->to, sizeof(tx->to)) ||
	    !eth_rlp_append_uint64(&payload, tx->value_wei) ||
	    !eth_rlp_append_bytes(&payload, tx->data, tx->data_len) ||
	    !eth_rlp_append_uint64(&payload, tx->chain_id) ||
	    !eth_rlp_append_uint64(&payload, 0U) ||
	    !eth_rlp_append_uint64(&payload, 0U)) {
		return false;
	}

	if (!eth_rlp_wrap_list(&rlp, payload.data, payload.len)) {
		return false;
	}

	*out_len = rlp.len;
	return true;
}

static bool eth_build_signed_rlp(const eth_legacy_tx_t *tx, uint8_t *out,
				 size_t out_cap, size_t *out_len,
				 uint64_t v, const uint8_t r[32], const uint8_t s[32])
{
	uint8_t payload_storage[288] = { 0 };
	eth_buf_t payload = { .data = payload_storage, .len = 0, .cap = sizeof(payload_storage) };
	eth_buf_t rlp = { .data = out, .len = 0, .cap = out_cap };

	if (!eth_rlp_append_uint64(&payload, tx->nonce) ||
	    !eth_rlp_append_uint64(&payload, tx->gas_price_wei) ||
	    !eth_rlp_append_uint64(&payload, tx->gas_limit) ||
	    !eth_rlp_append_bytes(&payload, tx->to, sizeof(tx->to)) ||
	    !eth_rlp_append_uint64(&payload, tx->value_wei) ||
	    !eth_rlp_append_bytes(&payload, tx->data, tx->data_len) ||
	    !eth_rlp_append_uint64(&payload, v) ||
	    !eth_rlp_append_bigint(&payload, r, 32U) ||
	    !eth_rlp_append_bigint(&payload, s, 32U)) {
		return false;
	}

	if (!eth_rlp_wrap_list(&rlp, payload.data, payload.len)) {
		return false;
	}

	*out_len = rlp.len;
	return true;
}

static const uint8_t *eth_find_uncompressed_ec_point(const uint8_t *key,
						     size_t key_len,
						     size_t *point_len)
{
	const uint8_t *point = NULL;

	for (size_t i = 0; (i + ETH_SECP256K1_PUBKEY_LEN) <= key_len; i++) {
		if (key[i] == 0x04U) {
			point = &key[i];
		}
	}

	if (point != NULL) {
		*point_len = ETH_SECP256K1_PUBKEY_LEN;
	}

	return point;
}

static bool eth_curve_status_is_set(const uint8_t *curve_list, size_t curve_list_len,
				    SE05x_ECCurve_t curve_id)
{
	if (curve_id == kSE05x_ECCurve_NA || (size_t)(curve_id - 1U) >= curve_list_len) {
		return false;
	}

	return curve_list[curve_id - 1U] == kSE05x_SetIndicator_SET;
}

static smStatus_t eth_read_secp256k1_status(pSe05xSession_t session, bool *is_set)
{
	uint8_t curve_list[32] = { 0 };
	size_t curve_list_len = sizeof(curve_list);
	smStatus_t sw = Se05x_API_ReadECCurveList(session, curve_list, &curve_list_len);

	if (sw == SM_OK) {
		*is_set = eth_curve_status_is_set(curve_list, curve_list_len,
						  kSE05x_ECCurve_Secp256k1);
		LOG_INF("ReadECCurveList len=%u Secp256k1=%s", (unsigned int)curve_list_len,
			*is_set ? "SET" : "NOT_SET");
	}

	return sw;
}

static bool eth_ensure_secp256k1_curve(se05x_demo_stats_t *stats, pSe05xSession_t session)
{
	bool is_set = false;
	smStatus_t sw = eth_read_secp256k1_status(session, &is_set);

	if (sw != SM_OK) {
		se05x_demo_mark_fail_sw(stats, "ReadECCurveList(before)", sw);
		return false;
	}

	if (is_set) {
		se05x_demo_mark_pass(stats, "Secp256k1AlreadySET");
		return true;
	}

	LOG_WRN("Secp256k1 is NOT_SET; creating curve writes SE05x persistent NVM once");
	sw = Se05x_API_CreateCurve_secp256k1(session, kSE05x_ECCurve_Secp256k1);
	if (sw != SM_OK) {
		se05x_demo_mark_fail_sw(stats, "CreateCurve_secp256k1", sw);
		return false;
	}
	se05x_demo_mark_pass(stats, "CreateCurve_secp256k1");

	sw = eth_read_secp256k1_status(session, &is_set);
	if (sw != SM_OK) {
		se05x_demo_mark_fail_sw(stats, "ReadECCurveList(after)", sw);
		return false;
	}

	if (!is_set) {
		se05x_demo_mark_fail_sw(stats, "Secp256k1StillNOT_SET", SM_NOT_OK);
		return false;
	}

	se05x_demo_mark_pass(stats, "Secp256k1SETAfterCreate");
	return true;
}

static bool eth_wallet_key_exists(se05x_demo_stats_t *stats,
				  pSe05xSession_t se_session,
				  bool *exists)
{
	SE05x_Result_t result = kSE05x_Result_NA;
	smStatus_t sw = Se05x_API_CheckObjectExists(se_session,
						    SE05X_DEMO_OBJECT_ID_ETH_TESTNET_WALLET,
						    &result);

	if (sw != SM_OK) {
		se05x_demo_mark_fail_sw(stats, "CheckObjectExists(ETH_TESTNET_KEY)", sw);
		return false;
	}

	*exists = (result == kSE05x_Result_SUCCESS);
	return true;
}

static bool eth_delete_wallet_key_if_confirmed(se05x_demo_stats_t *stats,
					       pSe05xSession_t se_session)
{
	bool exists = false;

	if (!eth_wallet_key_exists(stats, se_session, &exists)) {
		return false;
	}

	if (!exists) {
		printk("OK wallet key already absent object_id=0x%08" PRIX32 "\n",
		       (uint32_t)SE05X_DEMO_OBJECT_ID_ETH_TESTNET_WALLET);
		se05x_demo_mark_pass(stats, "WalletKeyAlreadyAbsent");
		return true;
	}

	LOG_WRN("deleting persistent Demo11 wallet key object_id=0x%08" PRIX32,
		(uint32_t)SE05X_DEMO_OBJECT_ID_ETH_TESTNET_WALLET);
	smStatus_t sw = Se05x_API_DeleteSecureObject(se_session,
						     SE05X_DEMO_OBJECT_ID_ETH_TESTNET_WALLET);
	if (sw != SM_OK) {
		se05x_demo_mark_fail_sw(stats, "DeleteSecureObject(ETH_TESTNET_KEY)", sw);
		return false;
	}

	printk("OK deleted persistent wallet key object_id=0x%08" PRIX32 "\n",
	       (uint32_t)SE05X_DEMO_OBJECT_ID_ETH_TESTNET_WALLET);
	se05x_demo_mark_pass(stats, "DeleteEthTestnetWalletKey");
	return true;
}

