tianrking/nrf54lm20-se05x-ncs/demo/se05x_demo_11_eth_testnet_wallet.c
static bool eth_prepare_persistent_wallet_key(se05x_demo_stats_t *stats,
					      ex_sss_boot_ctx_t *boot_ctx,
					      pSe05xSession_t se_session,
					      sss_object_t *wallet_key)
{
	bool exists = false;
	sss_status_t status;

	if (!eth_wallet_key_exists(stats, se_session, &exists)) {
		return false;
	}

	status = sss_key_object_init(wallet_key, &boot_ctx->ks);
	if (status != kStatus_SSS_Success) {
		se05x_demo_mark_fail_status(stats, "sss_key_object_init(ETH_TESTNET)", status);
		return false;
	}

	if (exists) {
		status = sss_key_object_get_handle(wallet_key,
						   SE05X_DEMO_OBJECT_ID_ETH_TESTNET_WALLET);
		if (status != kStatus_SSS_Success) {
			se05x_demo_mark_fail_status(stats, "GetHandle(ETH_TESTNET_KEY)", status);
			return false;
		}

		printk("ETH_WALLET_KEY_OBJECT_ID=0x%08" PRIX32 "\n",
		       (uint32_t)SE05X_DEMO_OBJECT_ID_ETH_TESTNET_WALLET);
		printk("ETH_WALLET_KEY_CREATED=no\n");
		se05x_demo_mark_pass(stats, "GetHandle(ETH_TESTNET_KEY)");
		return true;
	}

	LOG_WRN("creating persistent Demo11 wallet key object_id=0x%08" PRIX32,
		(uint32_t)SE05X_DEMO_OBJECT_ID_ETH_TESTNET_WALLET);

	status = sss_key_object_allocate_handle(wallet_key,
					       SE05X_DEMO_OBJECT_ID_ETH_TESTNET_WALLET,
					       kSSS_KeyPart_Pair,
					       kSSS_CipherType_EC_NIST_K,
					       32, kKeyObject_Mode_Persistent);
	if (status != kStatus_SSS_Success) {
		se05x_demo_mark_fail_status(stats, "AllocateHandle(ETH_TESTNET_KEY)", status);
		return false;
	}

	status = sss_key_store_generate_key(&boot_ctx->ks, wallet_key, 256, NULL);
	if (status != kStatus_SSS_Success) {
		se05x_demo_mark_fail_status(stats, "GenerateKey(ETH_TESTNET_KEY)", status);
		return false;
	}

	printk("ETH_WALLET_KEY_OBJECT_ID=0x%08" PRIX32 "\n",
	       (uint32_t)SE05X_DEMO_OBJECT_ID_ETH_TESTNET_WALLET);
	printk("ETH_WALLET_KEY_CREATED=yes\n");
	se05x_demo_mark_pass(stats, "GenerateKey(ETH_TESTNET_KEY)");
	return true;
}

static bool eth_export_public_key_and_address(se05x_demo_stats_t *stats,
					      ex_sss_boot_ctx_t *boot_ctx,
					      sss_object_t *wallet_key,
					      uint8_t point_out[ETH_SECP256K1_PUBKEY_LEN],
					      uint8_t address_out[ETH_ADDRESS_LEN])
{
	uint8_t public_key[160] = { 0 };
	uint8_t address_hash[ETH_KECCAK256_LEN] = { 0 };
	size_t public_key_len = sizeof(public_key);
	size_t public_key_bits = 0U;
	size_t point_len = 0U;
	const uint8_t *point;
	sss_status_t status;

	status = sss_key_store_get_key(&boot_ctx->ks, wallet_key, public_key,
				       &public_key_len, &public_key_bits);
	if (status != kStatus_SSS_Success) {
		se05x_demo_mark_fail_status(stats, "GetPublicKey(SECP256K1)", status);
		return false;
	}

	point = eth_find_uncompressed_ec_point(public_key, public_key_len, &point_len);
	if (point == NULL) {
		se05x_demo_mark_fail_sw(stats, "ExtractPublicKey04XY", SM_NOT_OK);
		return false;
	}

	memcpy(point_out, point, ETH_SECP256K1_PUBKEY_LEN);
	eth_keccak256(&point[1], 64U, address_hash);
	memcpy(address_out, &address_hash[12], ETH_ADDRESS_LEN);

	eth_print_hex_block("ETH_PUBLIC_KEY_DER", public_key, public_key_len);
	eth_print_hex_block("ETH_PUBLIC_KEY_UNCOMPRESSED_04XY", point_out,
			    ETH_SECP256K1_PUBKEY_LEN);
	eth_print_hex_inline("ETH_FROM_ADDRESS", address_out, ETH_ADDRESS_LEN);
	se05x_demo_mark_pass(stats, "GetPublicKeyAndEthAddress");

	return true;
}

static bool eth_der_read_len(const uint8_t *der, size_t der_len, size_t *offset, size_t *out_len)
{
	if (*offset >= der_len) {
		return false;
	}

	uint8_t first = der[(*offset)++];
	if ((first & 0x80U) == 0U) {
		*out_len = first;
		return true;
	}

	size_t count = first & 0x7fU;
	if (count == 0U || count > sizeof(size_t) || *offset + count > der_len) {
		return false;
	}

	size_t value = 0;
	for (size_t i = 0; i < count; i++) {
		value = (value << 8U) | der[(*offset)++];
	}
	*out_len = value;
	return true;
}

static bool eth_copy_der_int_to_32(const uint8_t *value, size_t value_len, uint8_t out[32])
{
	while (value_len > 0U && *value == 0U) {
		++value;
		--value_len;
	}

	if (value_len > 32U) {
		return false;
	}

	memset(out, 0, 32U);
	memcpy(&out[32U - value_len], value, value_len);
	return true;
}

static bool eth_parse_ecdsa_der_rs(const uint8_t *der, size_t der_len, uint8_t r[32],
				   uint8_t s[32])
{
	size_t off = 0;
	size_t seq_len = 0;
	size_t int_len = 0;

	if (der_len < 8U || der[off++] != 0x30U ||
	    !eth_der_read_len(der, der_len, &off, &seq_len) ||
	    off + seq_len != der_len) {
		return false;
	}

	if (off >= der_len || der[off++] != 0x02U ||
	    !eth_der_read_len(der, der_len, &off, &int_len) ||
	    off + int_len > der_len ||
	    !eth_copy_der_int_to_32(&der[off], int_len, r)) {
		return false;
	}
	off += int_len;

	if (off >= der_len || der[off++] != 0x02U ||
	    !eth_der_read_len(der, der_len, &off, &int_len) ||
	    off + int_len > der_len ||
	    !eth_copy_der_int_to_32(&der[off], int_len, s)) {
		return false;
	}

	return off + int_len == der_len;
}

static bool eth_s_is_high(const uint8_t s[32])
{
	return memcmp(s, k_secp256k1_half_n, 32U) > 0;
}

static void eth_subtract_from_n(const uint8_t s[32], uint8_t out[32])
{
	int borrow = 0;

	for (int i = 31; i >= 0; i--) {
		int value = (int)k_secp256k1_n[i] - (int)s[i] - borrow;
		if (value < 0) {
			value += 256;
			borrow = 1;
		} else {
			borrow = 0;
		}
		out[i] = (uint8_t)value;
	}
}

static bool eth_sign_and_print_transaction(se05x_demo_stats_t *stats,
					   ex_sss_boot_ctx_t *boot_ctx,
					   pSe05xSession_t se_session,
					   const eth_legacy_tx_t *tx)
{
	sss_object_t wallet_key = { 0 };
	sss_asymmetric_t sign_ctx = { 0 };
	sss_asymmetric_t verify_ctx = { 0 };
	uint8_t public_point[ETH_SECP256K1_PUBKEY_LEN] = { 0 };
	uint8_t from_address[ETH_ADDRESS_LEN] = { 0 };
	uint8_t signing_rlp[ETH_MAX_RLP_LEN] = { 0 };
	uint8_t signing_hash[ETH_KECCAK256_LEN] = { 0 };
	uint8_t signature_der[128] = { 0 };
	uint8_t sig_r[32] = { 0 };
	uint8_t sig_s_raw[32] = { 0 };
	uint8_t sig_s_low[32] = { 0 };
	uint8_t raw_tx_0[ETH_MAX_RLP_LEN] = { 0 };
	uint8_t raw_tx_1[ETH_MAX_RLP_LEN] = { 0 };
	size_t signing_rlp_len = 0;
	size_t signature_der_len = sizeof(signature_der);
	size_t raw_tx_0_len = 0;
	size_t raw_tx_1_len = 0;
	uint64_t v_candidate_0;
	uint64_t v_candidate_1;
	bool s_was_high = false;
	sss_status_t status;

