tianrking/nrf54lm20-se05x-ncs/demo/se05x_demo_11_eth_testnet_wallet.c
	if (!eth_build_signing_rlp(tx, signing_rlp, sizeof(signing_rlp), &signing_rlp_len)) {
		se05x_demo_mark_fail_sw(stats, "BuildEthSigningRLP", SM_NOT_OK);
		return false;
	}

	eth_keccak256(signing_rlp, signing_rlp_len, signing_hash);

	eth_print_current_tx(tx);
	eth_print_hex_block("ETH_SIGNING_RLP", signing_rlp, signing_rlp_len);
	eth_print_hex_inline("ETH_SIGNING_HASH_KECCAK256", signing_hash, sizeof(signing_hash));
	se05x_demo_mark_pass(stats, "BuildEthSigningPayload");

	if (!eth_prepare_persistent_wallet_key(stats, boot_ctx, se_session, &wallet_key)) {
		return false;
	}

	if (!eth_export_public_key_and_address(stats, boot_ctx, &wallet_key,
					       public_point, from_address)) {
		goto cleanup;
	}

	status = sss_asymmetric_context_init(&sign_ctx, &boot_ctx->session, &wallet_key,
					     kAlgorithm_SSS_SHA256, kMode_SSS_Sign);
	if (status != kStatus_SSS_Success) {
		se05x_demo_mark_fail_status(stats, "AsymContext(SignETH)", status);
		goto cleanup;
	}

	status = sss_asymmetric_sign_digest(&sign_ctx, signing_hash, sizeof(signing_hash),
					    signature_der, &signature_der_len);
	if (status != kStatus_SSS_Success) {
		se05x_demo_mark_fail_status(stats, "SignDigest(ETH_KECCAK)", status);
		goto cleanup;
	}
	eth_print_hex_block("ETH_SIGNATURE_DER", signature_der, signature_der_len);
	se05x_demo_mark_pass(stats, "SignDigest(ETH_KECCAK)");

	status = sss_asymmetric_context_init(&verify_ctx, &boot_ctx->session, &wallet_key,
					     kAlgorithm_SSS_SHA256, kMode_SSS_Verify);
	if (status != kStatus_SSS_Success) {
		se05x_demo_mark_fail_status(stats, "AsymContext(VerifyETH)", status);
		goto cleanup;
	}

	status = sss_asymmetric_verify_digest(&verify_ctx, signing_hash, sizeof(signing_hash),
					      signature_der, signature_der_len);
	if (status == kStatus_SSS_Success) {
		se05x_demo_mark_pass(stats, "VerifyDigest(ETH_KECCAK)");
	} else {
		se05x_demo_mark_fail_status(stats, "VerifyDigest(ETH_KECCAK)", status);
		goto cleanup;
	}

	if (!eth_parse_ecdsa_der_rs(signature_der, signature_der_len, sig_r, sig_s_raw)) {
		se05x_demo_mark_fail_sw(stats, "ParseDerSignatureRS", SM_NOT_OK);
		goto cleanup;
	}

	s_was_high = eth_s_is_high(sig_s_raw);
	if (s_was_high) {
		eth_subtract_from_n(sig_s_raw, sig_s_low);
	} else {
		memcpy(sig_s_low, sig_s_raw, sizeof(sig_s_low));
	}

	eth_print_hex_inline("ETH_SIGNATURE_R", sig_r, sizeof(sig_r));
	eth_print_hex_inline("ETH_SIGNATURE_S_RAW", sig_s_raw, sizeof(sig_s_raw));
	eth_print_hex_inline("ETH_SIGNATURE_S_LOW", sig_s_low, sizeof(sig_s_low));
	printk("ETH_SIGNATURE_S_WAS_HIGH=%s\n", s_was_high ? "yes" : "no");
	if (tx->chain_id > (UINT64_MAX - 36ULL) / 2ULL) {
		se05x_demo_mark_fail_sw(stats, "BuildEip155VOverflow", SM_NOT_OK);
		goto cleanup;
	}
	v_candidate_0 = (tx->chain_id * 2ULL) + 35ULL;
	v_candidate_1 = (tx->chain_id * 2ULL) + 36ULL;
	printk("ETH_V_CANDIDATE_0=%" PRIu64 "\n", v_candidate_0);
	printk("ETH_V_CANDIDATE_1=%" PRIu64 "\n", v_candidate_1);
	se05x_demo_mark_pass(stats, "ParseSignatureForEthereum");

	if (!eth_build_signed_rlp(tx, raw_tx_0, sizeof(raw_tx_0), &raw_tx_0_len,
				  v_candidate_0, sig_r, sig_s_low) ||
	    !eth_build_signed_rlp(tx, raw_tx_1, sizeof(raw_tx_1), &raw_tx_1_len,
				  v_candidate_1, sig_r, sig_s_low)) {
		se05x_demo_mark_fail_sw(stats, "BuildSignedRawTransaction", SM_NOT_OK);
		goto cleanup;
	}

	eth_print_hex_inline("ETH_RAW_TX_CANDIDATE_V0", raw_tx_0, raw_tx_0_len);
	eth_print_hex_inline("ETH_RAW_TX_CANDIDATE_V1", raw_tx_1, raw_tx_1_len);
	printk("ETH_NEXT_STEP=PC or phone recovers signer address and selects the matching v.\n");
	se05x_demo_mark_pass(stats, "BuildSignedRawTransactionCandidates");

cleanup:
	if (sign_ctx.session != NULL) {
		sss_asymmetric_context_free(&sign_ctx);
	}
	if (verify_ctx.session != NULL) {
		sss_asymmetric_context_free(&verify_ctx);
	}
	sss_key_object_free(&wallet_key);

	return stats->fail == 0U;
}

static sss_status_t run_eth_testnet_wallet_once(ex_sss_boot_ctx_t *boot_ctx,
					     const eth_legacy_tx_t *tx)
{
	se05x_demo_stats_t stats;
	sss_se05x_session_t *session = (sss_se05x_session_t *)&boot_ctx->session;
	pSe05xSession_t se_session = &session->s_ctx;

	se05x_demo_stats_init(&stats, "ETH_TESTNET_WALLET");
	LOG_INF("ETH_TESTNET_WALLET started: legacy tx RLP + Keccak + SE05x secp256k1 sign");
	LOG_WRN("This demo may write SE05x NVM once if secp256k1 is NOT_SET");

	if (eth_ensure_secp256k1_curve(&stats, se_session)) {
		(void)eth_sign_and_print_transaction(&stats, boot_ctx, se_session, tx);
	}

	se05x_demo_log_summary(&stats);
	return se05x_demo_stats_result(&stats);
}

static sss_status_t run_eth_testnet_address_once(ex_sss_boot_ctx_t *boot_ctx)
{
	se05x_demo_stats_t stats;
	sss_se05x_session_t *session = (sss_se05x_session_t *)&boot_ctx->session;
	pSe05xSession_t se_session = &session->s_ctx;
	sss_object_t wallet_key = { 0 };
	uint8_t public_point[ETH_SECP256K1_PUBKEY_LEN] = { 0 };
	uint8_t from_address[ETH_ADDRESS_LEN] = { 0 };

	se05x_demo_stats_init(&stats, "ETH_TESTNET_ADDRESS");
	LOG_INF("ETH_TESTNET_ADDRESS started: create/reuse persistent secp256k1 wallet key");
	LOG_WRN("This command may write SE05x NVM if curve or wallet key is missing");

	if (eth_ensure_secp256k1_curve(&stats, se_session) &&
	    eth_prepare_persistent_wallet_key(&stats, boot_ctx, se_session, &wallet_key)) {
		(void)eth_export_public_key_and_address(&stats, boot_ctx, &wallet_key,
							public_point, from_address);
	}

	sss_key_object_free(&wallet_key);
	se05x_demo_log_summary(&stats);
	return se05x_demo_stats_result(&stats);
}

static sss_status_t run_eth_testnet_delete_wallet_key(ex_sss_boot_ctx_t *boot_ctx)
{
	se05x_demo_stats_t stats;
	sss_se05x_session_t *session = (sss_se05x_session_t *)&boot_ctx->session;
	pSe05xSession_t se_session = &session->s_ctx;

	se05x_demo_stats_init(&stats, "ETH_TESTNET_DELETE_KEY");
	(void)eth_delete_wallet_key_if_confirmed(&stats, se_session);
	se05x_demo_log_summary(&stats);
	return se05x_demo_stats_result(&stats);
}

static sss_status_t run_eth_testnet_wallet(ex_sss_boot_ctx_t *boot_ctx)
{
	sss_status_t last_status = kStatus_SSS_Success;
	int err = console_init();

	if (err != 0) {
		LOG_ERR("console_init failed: %d", err);
		return kStatus_SSS_Fail;
	}

	eth_reset_tx_to_sample(&g_eth_tx);
	eth_print_menu();
	eth_print_current_tx(&g_eth_tx);

	while (1) {
		char line_storage[ETH_UART_CMD_MAX_LEN] = { 0 };
		printk("se05x-eth-testnet> ");
		if (!eth_read_uart_line(line_storage, sizeof(line_storage))) {
			printk("\nERR command too long. Type AT+H for help.\n");
			continue;
		}

		char *line = eth_trim_line(line_storage);
		if (strlen(line) == 4U &&
		    (line[0] == 'A' || line[0] == 'a') &&
		    (line[1] == 'T' || line[1] == 't') &&
		    line[2] == '+') {
			const char cmd = eth_upper_command_char(line[3]);

			switch (cmd) {
			case 'H':
				printk("\nCMD AT+H -> Show menu\n");
				eth_print_menu();
				break;
			case 'A':
				printk("\nCMD AT+A -> Create/reuse wallet key and print address\n");
				last_status = run_eth_testnet_address_once(boot_ctx);
				break;
			case 'P':
				printk("\nCMD AT+P -> Print current transaction\n");
				eth_print_current_tx(&g_eth_tx);
				break;
			case 'R':
				printk("\nCMD AT+R -> Reset transaction to sample values\n");
				eth_reset_tx_to_sample(&g_eth_tx);
				eth_print_current_tx(&g_eth_tx);
				break;
			case 'S':
				printk("\nCMD AT+S -> Sign current ETH legacy transaction\n");
				last_status = run_eth_testnet_wallet_once(boot_ctx, &g_eth_tx);
				break;
			case 'Q':
				printk("\nCMD AT+Q -> Quit Demo 11\n");
				return last_status;
			default:
				printk("\nUnknown command. Type AT+H for help.\n");
				break;
			}
		} else if (eth_handle_set_command(line, &g_eth_tx)) {
			/* The setter already printed the updated field. */
		} else if (strcmp(line, "AT+X=DELETE_TESTNET_KEY") == 0 ||
			   strcmp(line, "at+x=delete_testnet_key") == 0) {
			printk("\nCMD AT+X=DELETE_TESTNET_KEY -> Delete persistent wallet key\n");
			last_status = run_eth_testnet_delete_wallet_key(boot_ctx);
		} else {
			printk("\nUnknown command. Type AT+H for help.\n");
		}
	}
}

const se05x_demo_t g_se05x_demo_eth_testnet_wallet = {
	.id = SE05X_DEMO_ETH_TESTNET_WALLET,
	.name = "eth_testnet_wallet",
	.when_to_use = "Create a stable SE05x-backed Sepolia wallet address and sign real testnet tx fields.",
	.flow = "Reuse/create persistent secp256k1 key, build RLP, Keccak it, sign in SE05x, print raw tx candidates.",
	.expected_output = "Stable ETH address, signing hash, DER signature, r/s, raw tx candidates, fail=0.",
	.se_features = "secp256k1 curve, EC_NIST_K persistent key, public key export, ECDSA sign/verify.",
	.run = run_eth_testnet_wallet,
};
